
#დავალება 1
#num1,num2,num3-ვანიჭებთ 5ის მნიშვნელობას და ვპრინტავთ მათ შეკრებას და ვიღებთ პასუხად 15.
num1=5
num2=5
num3=5
print(num1+num2+num3)

#დავალება 2
#x ენიჭება 5 y ენიჭება 5 და ვპრინთავთ გამრავლების ბრძანებას პასუხს კი 25 ვიღებთ.
x=5
y=5
print(5*5)

#დავალება 3
#age1,age2,age3 მიენიჭა 16,17,16 და ვპრინტავთ მათ შეკრებას და ისევ ვპრინტავთ ჯამი რო გავყოთ ორზე.
age1=16
age2=17
age3=16
print(age1+age2+age3)
print(49/2)

#დავალება 4
#name და surname ში წერია ცვლადები, შემდეგ resultში მოვახდინეთ კონკადინაცია და დავპრინტეთ. (კონკოდინაცია არის concatenation ორი სტრინგის ერთმანეთთან შეერთება.)
name="Giorgi" 
surname="Gamtsemlidze"
result=(name+surname)
print(result)
#დავალება 5
#age და fullname ში წერია ცვლადები, შემდეგ დავპრინტეთ  16 ჯერ ასაკის მიხედვით. (ერთი print() ფუნქციის მეშვეობით.)
age=16
fullname=("GiorgiGamtsemlidze")
print(fullname*16)

#დავალება 6
# დეკლარაცია არის ცვლადის შექმნა, ინიციალიზება არის ცვლადისთვის მნიშვნელობის შექმნა, ხოლო რეინიციალიზება არის შექმნილი ცვლადის მნიშვნელობის შეცვლა. ამათ შორის განსხვავება ის არის რომ დეკლარაცია არის არსებული ცვლადის წარმოჩენა, ინიციალიზება არის ცვალიდსთვის მნიშვნელობის მიცემა ხოლო რეინციალიზება არის შექმნილი ცვლადისთვის მნიშვნელობის შეცვლა. მაგალითად:დეკლარაციის შემთხვევაში ესეთი მაგალთი გვექნება
#აქ x და y ცვლადი ენიჭება და შეგვძლია integer მაგალითში არითმეტიკულად ვიმუშაოთ.
#x=5
#y="გიორგი"
#print(x)
#print(y)
#ინიციალიზების შემთხვევაში გვექნება 
#age=16
#print(age)
#აქ age არის მთელი რიცხვი(integer),რომელიც ინიციალიზებულია მნიშვნელობით 16.
#name=("Giorgi")
#print(name)
#აქაც იგივეა name რომელიც ინიციალიზებულია მნიშვნელობით Giorgi
#რეინიციალიზების შემთხვევაში აქ 51 ხაზზე ვხეავთ ცვლად მინიჭებულ age და დაიპრინტება მოთავსებული ცვლადი ხოლო 55 ხაზზე ვხედავთ ისევ ცვლადმინიჭებულ age,რომელის წინაც პრინტია. ანუ ჩვენ მოვახდინეთ მნიშვნელობის შეცვლა შქმნილი ცვლადისათვის რადგან პითონი პირველი ბრძანების შემდეგ მომდევნო ბრძანებას წაიკითხვს.

#age=16

#print(age)

#age=17

#print (age)


